In [1]:
import pandas as pd

<h1> 2023 DATA </h1>  
<h3> January, February, March, April, May, June </h3>

In [2]:
g23 = pd.read_csv("2023.csv")

In [3]:
g23.head()

,Address,County,Full,Date,Full Market Price,VAT exclusive,Latitude,Longitude
0,"15 ST JOHNS TERRACE, OLD YOUGHAL RD, CORK CITY",Cork,"15 ST JOHNS TERRACE, OLD YOUGHAL RD, CORK CITY...",2023-01-01,1,0,51.911373,-8.442231
1,"2 KINGS TERRACE, CORK CITY, CORK",Cork,"2 KINGS TERRACE, CORK CITY, CORK, Cork",2023-01-01,1,0,51.901490,-8.463452
2,"22 COVE ST, CORK CITY, CORK",Cork,"22 COVE ST, CORK CITY, CORK, Cork",2023-01-01,1,0,51.895019,-8.475927
3,"3 PARK HILL, SKEHARD RD, CORK",Cork,"3 PARK HILL, SKEHARD RD, CORK, Cork",2023-01-01,1,0,51.886775,-8.427577
4,"4 SULLIVANS LANE, BARRACK ST, CORK",Cork,"4 SULLIVANS LANE, BARRACK ST, CORK, Cork",2023-01-01,1,0,51.892899,-8.478891

In [4]:
g23.index.is_monotonic_increasing #!!!

True

In [5]:
org = pd.read_csv("PPR-ALL.csv", encoding='ISO-8859-1', low_memory=False)

In [6]:
org['Full'] = org['Address']+", "+org['County']
org['Date'] = pd.to_datetime(org['Date of Sale (dd/mm/yyyy)'], format='%d/%m/%Y')
org['Full Market Price'] = org['Not Full Market Price'].replace({'Yes':0, 'No':1})
org['VAT exclusive'] = org['VAT Exclusive'].replace({'Yes':1, 'No':0})

In [7]:
org['Price'] = (org.iloc[:,4]
                .str.replace(',', '')
                .str.slice(1)
                .astype('float32'))

In [8]:
#remove all the unnecessary columns
ogr = (org
   .drop('Price ()', axis=1)
   .drop('Eircode', axis=1)
   .drop('Property Size Description', axis=1)
   .drop('Not Full Market Price' ,axis=1)
   .drop('VAT Exclusive',axis=1)
   .drop('Date of Sale (dd/mm/yyyy)',axis=1)
   .drop('Description of Property',axis=1)

)

In [9]:
ogr.head()

,Address,County,Full,Date,Full Market Price,VAT exclusive,Price
0,"5 Braemor Drive, Churchtown, Co.Dublin",Dublin,"5 Braemor Drive, Churchtown, Co.Dublin, Dublin",2010-01-01,1,0,343000.0
1,"134 Ashewood Walk, Summerhill Lane, Portlaoise",Laois,"134 Ashewood Walk, Summerhill Lane, Portlaoise...",2010-01-03,1,1,185000.0
2,"1 Meadow Avenue, Dundrum, Dublin 14",Dublin,"1 Meadow Avenue, Dundrum, Dublin 14, Dublin",2010-01-04,1,0,438500.0
3,"1 The Haven, Mornington",Meath,"1 The Haven, Mornington, Meath",2010-01-04,1,0,400000.0
4,"11 Melville Heights, Kilkenny",Kilkenny,"11 Melville Heights, Kilkenny, Kilkenny",2010-01-04,1,0,160000.0

In [10]:
org = ogr

In [11]:
start = pd.to_datetime('2023-01-01')  
end = pd.to_datetime('2023-06-30')
org = org[(org['Date'] >= start) & (org['Date'] <= end)]
org = org.sort_values('Date')

In [12]:
org = org.reset_index(drop=True)

In [13]:
org.tail()

,Address,County,Full,Date,Full Market Price,VAT exclusive,Price
26595,"28 CHURCH LANE, MOATE, CO WESTMEATH",Westmeath,"28 CHURCH LANE, MOATE, CO WESTMEATH, Westmeath",2023-06-30,1,0,182000.0
26596,"28 EVERGREEN BUILDINGS, CORK, CORK",Cork,"28 EVERGREEN BUILDINGS, CORK, CORK, Cork",2023-06-30,1,0,215000.0
26597,"28 MILLBANK, THE LINKS, STATION RD PORTMARNOCK",Dublin,"28 MILLBANK, THE LINKS, STATION RD PORTMARNO...",2023-06-30,1,0,385000.0
26598,"218 ABBEYLANDS, MULLINGAR, WESTMEATH",Westmeath,"218 ABBEYLANDS, MULLINGAR, WESTMEATH, Westmeath",2023-06-30,1,0,208000.0
26599,"WOODBINE, ESTUARY RD, YELLOW WALLS",Dublin,"WOODBINE, ESTUARY RD, YELLOW WALLS, Dublin",2023-06-30,0,0,180000.0

In [14]:
g23.tail()

,Address,County,Full,Date,Full Market Price,VAT exclusive,Latitude,Longitude
26595,"28 CHURCH LANE, MOATE, CO WESTMEATH",Westmeath,"28 CHURCH LANE, MOATE, CO WESTMEATH, Westmeath",2023-06-30,1,0,53.395653,-7.727967
26596,"28 EVERGREEN BUILDINGS, CORK, CORK",Cork,"28 EVERGREEN BUILDINGS, CORK, CORK, Cork",2023-06-30,1,0,51.894093,-8.476013
26597,"28 MILLBANK, THE LINKS, STATION RD PORTMARNOCK",Dublin,"28 MILLBANK, THE LINKS, STATION RD PORTMARNO...",2023-06-30,1,0,53.418212,-6.146101
26598,"218 ABBEYLANDS, MULLINGAR, WESTMEATH",Westmeath,"218 ABBEYLANDS, MULLINGAR, WESTMEATH, Westmeath",2023-06-30,1,0,53.530947,-7.353680
26599,"WOODBINE, ESTUARY RD, YELLOW WALLS",Dublin,"WOODBINE, ESTUARY RD, YELLOW WALLS, Dublin",2023-06-30,0,0,53.451169,-6.184779

In [15]:
df23 = pd.merge(g23, org[['Address', 'Price']], on='Address', how='right')

In [17]:
df23.tail()

,Address,County,Full,Date,Full Market Price,VAT exclusive,Latitude,Longitude,Price
26869,"28 CHURCH LANE, MOATE, CO WESTMEATH",Westmeath,"28 CHURCH LANE, MOATE, CO WESTMEATH, Westmeath",2023-06-30,1,0,53.395653,-7.727967,182000.0
26870,"28 EVERGREEN BUILDINGS, CORK, CORK",Cork,"28 EVERGREEN BUILDINGS, CORK, CORK, Cork",2023-06-30,1,0,51.894093,-8.476013,215000.0
26871,"28 MILLBANK, THE LINKS, STATION RD PORTMARNOCK",Dublin,"28 MILLBANK, THE LINKS, STATION RD PORTMARNO...",2023-06-30,1,0,53.418212,-6.146101,385000.0
26872,"218 ABBEYLANDS, MULLINGAR, WESTMEATH",Westmeath,"218 ABBEYLANDS, MULLINGAR, WESTMEATH, Westmeath",2023-06-30,1,0,53.530947,-7.353680,208000.0
26873,"WOODBINE, ESTUARY RD, YELLOW WALLS",Dublin,"WOODBINE, ESTUARY RD, YELLOW WALLS, Dublin",2023-06-30,0,0,53.451169,-6.184779,180000.0

In [18]:
df23.to_csv("df23.csv")

<h1> 2022 DATA  </h1>  
<h3> December </h3>

In [10]:
pd.read_csv("2022.csv")

,Address,County,Full,Date,Full Market Price,VAT exclusive,Price,Latitude,Longitude
0,"03 GRAYDON GREEN, NEWCASTLE, CO DUBLIN",Dublin,"03 GRAYDON GREEN, NEWCASTLE, CO DUBLIN, Dublin",2022-12-01,1,1,409691.62,53.295794,-6.497725
1,"64 THE DRIVE, KILL ST LAWRENCE, WATERFORD",Waterford,"64 THE DRIVE, KILL ST LAWRENCE, WATERFORD, Wat...",2022-12-01,1,0,291000.00,52.235112,-7.108779
2,"64 SLI AN CHLAIRIN, CAHEROYAN, ATHENRY",Galway,"64 SLI AN CHLAIRIN, CAHEROYAN, ATHENRY, Galway",2022-12-01,1,0,270000.00,53.303425,-8.742269
3,"63 D MOYLARAGH RISE, BALBRIGGAN, DUBLIN",Dublin,"63 D MOYLARAGH RISE, BALBRIGGAN, DUBLIN, Dublin",2022-12-01,1,0,210000.00,53.610404,-6.201903
4,"63 CROMWELLSFORT GROVE, WEXFORD, WEXFORD",Wexford,"63 CROMWELLSFORT GROVE, WEXFORD, WEXFORD, Wexford",2022-12-01,1,0,187500.00,52.328798,-6.463182
...,...,...,...,...,...,...,...,...,...
6767,"3 BROAD RD, ARVA, CAVAN",Cavan,"3 BROAD RD, ARVA, CAVAN, Cavan",2022-12-30,1,0,161000.00,53.923102,-7.583107
6768,"8 SOUTH LOTTS ROAD, RINGSEND, DUBLIN 4",Dublin,"8 SOUTH LOTTS ROAD, RINGSEND, DUBLIN 4, Dublin",2022-12-31,1,0,287500.00,53.337499,-6.234289
6769,"83 Astor Lawn, Abbey Forte, Kinsale",Cork,"83 Astor Lawn, Abbey Forte, Kinsale, Cork",2022-12-31,1,1,311400.00,51.711772,-8.529397
6770,"29 Castle Park, Killycard, Castleblayney",Monaghan,"29 Castle Park, Killycard, Castleblayney, Mona...",2022-12-31,1,1,233480.17,54.117502,-6.754407
6771,"APT 22 - PEARSE COURT, PEARSE STREET, ATHLONE",Westmeath,"APT 22 - PEARSE COURT, PEARSE STREET, ATHLONE...",2022-12-31,1,0,120000.00,53.422149,-7.944692

In [11]:
g22 = pd.read_csv("2022.csv")

<h1>Full Dataset Cleaned Up</h1>

In [3]:
al = pd.read_csv("all.csv", encoding='ISO-8859-1', low_memory=False)

In [4]:
al['Full'] = al['Address']+", "+al['County']
al['Date'] = pd.to_datetime(al['Date of Sale (dd/mm/yyyy)'], format='%d/%m/%Y')
al['Full Market Price'] = al['Not Full Market Price'].replace({'Yes':0, 'No':1})
al['VAT exclusive'] = al['VAT Exclusive'].replace({'Yes':1, 'No':0})
al['Price'] = (al.iloc[:,4]
                .str.replace(',', '')
                .str.slice(1)
                .astype('float32'))

In [5]:
#remove all the unnecessary columns
al = (al
   .drop('Price ()', axis=1)
   .drop('Eircode', axis=1)
   .drop('Property Size Description', axis=1)
   .drop('Not Full Market Price' ,axis=1)
   .drop('VAT Exclusive',axis=1)
   .drop('Date of Sale (dd/mm/yyyy)',axis=1)
   .drop('Description of Property',axis=1)

)

In [6]:
al.head()

,Address,County,Full,Date,Full Market Price,VAT exclusive,Price
0,"5 Braemor Drive, Churchtown, Co.Dublin",Dublin,"5 Braemor Drive, Churchtown, Co.Dublin, Dublin",2010-01-01,1,0,343000.0
1,"134 Ashewood Walk, Summerhill Lane, Portlaoise",Laois,"134 Ashewood Walk, Summerhill Lane, Portlaoise...",2010-01-03,1,1,185000.0
2,"1 Meadow Avenue, Dundrum, Dublin 14",Dublin,"1 Meadow Avenue, Dundrum, Dublin 14, Dublin",2010-01-04,1,0,438500.0
3,"1 The Haven, Mornington",Meath,"1 The Haven, Mornington, Meath",2010-01-04,1,0,400000.0
4,"11 Melville Heights, Kilkenny",Kilkenny,"11 Melville Heights, Kilkenny, Kilkenny",2010-01-04,1,0,160000.0

<h4>Export the cleaned all file</h4>

In [7]:
al.to_csv("allclean.csv")